# Taps
tap 'brew cask installroom/brew cask install'
tap 'brew cask installroom/fonts'
tap 'brew cask installroom/versions'
tap 'homebrew/bundle'

brew cask install_args appdir: '/Applications'

# Install ZSH
brew 'zsh'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install Binaries
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'
brew 'm-cli'
brew 'openssl'
brew 'python'
brew 'ruby'
brew 'sqlite'
brew 'yadm'
brew 'yarn'

# Utilities
brew 'ripgrep'
brew 'thefuck'
brew 'youtube-dl'

# iOS Development
brew 'git-standup'
brew 'ideviceinstaller'
brew 'ios-webkit-debug-proxy'
brew 'cocoapods'
brew 'chisel'
brew 'vim'